Rails/basic_crud/app/controllers/products_controller.rb

INSERT INTO "products" ("name", "quantity", "price", "created_at", "updated_at") VALUES ('shirts', '1', '3999', '2025-09-04 07:23:01.028050', '2025-09-04 07:23:01.028050') RETURNING "id"
---
  def create
    @product = Product.new(product_params)
    if @product.save

SELECT "products".* FROM "products" WHERE "products"."id" = 5 LIMIT 1
UPDATE "products" SET "name" = 'asasas', "quantity" = '2', "price" = 'asasas', "updated_at" = '2025-09-04 08:11:27.999441' WHERE "products"."id" = 5
---
  def update
    @product = Product.find(params[:id])

    if @product.update(product_params)